Revit 2027 API
FailuresAccessor.SetFailureHandlingOptions Method
 Sets failure handling options for the transaction currently being finished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFailureHandlingOptions(
	FailureHandlingOptions options
)
Public Sub SetFailureHandlingOptions (
	options As FailureHandlingOptions
)
public:
void SetFailureHandlingOptions(
	FailureHandlingOptions^ options
)
member SetFailureHandlingOptions :
        options : FailureHandlingOptions -> unit
Parameters
options FailureHandlingOptions
 The failure handling options to be set for the transaction currently being finished.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
Remarks
 If used with returning ProceedWithRollback from (pre)processing, allows to dismiss errors and roll back transaction without any further failures processing and silently for the user.
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace